<!-- placeholder-1 -->
```fish
tofu plan -chdir=opentofu
```
<!-- placeholder-2 -->

<details><summary>Diff of 1 change.</summary>

```diff
+ google_artifact_registry_repository.linkedin_genai_gcr will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @aduuna at 2025-03-21T15:02:53Z [(view log)](https://github.com/Ishangoai/linkedin_genai/actions/runs/13994703283/job/39186835020#step:4:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_artifact_registry_repository.linkedin_genai_gcr will be created
  + resource "google_artifact_registry_repository" "linkedin_genai_gcr" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "europe-west2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "vincenttest13"
      + repository_id          = "vincenttest13-gcr"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-26-fbbc47ee48eefb117d29c2c615622afb.tfplan -->
<!-- placeholder-6 -->